vlm/extension/DataProcessors/ФормированиеСменныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФормированиеСменныхЗаданий</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

vlm/extension/Enums/ЕдиницыИзмеренияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЕдиницыИзмеренияВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сутки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Секунда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>День</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Documents/ПроизводственнаяОперация2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводственнаяОперация2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Documents/ЭтапПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЭтапПроизводства2_2</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АльтернативныеВидыРабочихЦентров</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыРабочихЦентров</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/DataProcessors/ФормированиеСменныхЗаданий/Forms/РабочееМесто/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [18.01.2026] +        
	
	Если РольДоступна("ПолныеПрава") 
		ИЛИ РольДоступна("бит_ЗаменаОборудования") Тогда
	
		//Кнопка
		Команда = ЭтаФорма.Команды.Добавить("бит_ЗаменитьОборудование");
		Команда.Действие = "бит_ЗаменитьОборудование";
		Команда.Заголовок = "(бит) Заменить оборудование";
		
		//Добавляем новую кнопку
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ЗаменитьОборудование", Тип("КнопкаФормы"), Элементы.КоманднаяПанельОперации);
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.Заголовок = "(бит) Заменить оборудование";
		НовыйЭлемент.ИмяКоманды = "бит_ЗаменитьОборудование"; 
		
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [18.01.2026] -
КонецПроцедуры

//&НаКлиенте
//Процедура ПриИзменениибит_ТиповаяФорма(Элемент)
//	// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 3:31:08] +        
//    // перенесем события при активации строки
//	НастроитьОтборОпераций();
//	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект, "СменыАктивнаяСтрока");
//	// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 3:31:08] -
//КонецПроцедуры

&НаКлиенте
Процедура бит_ЗаменитьОборудование(Команда)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [18.01.2026] +        
	ТекущиеДанные = Элементы.Операции.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ВыделенныеСтроки = Элементы.Операции.ВыделенныеСтроки;
		
		АдресТЗОперации = ПолучитьТЗОперации(ВыделенныеСтроки);

		Если АдресТЗОперации <> Неопределено Тогда
			
			ОповещениеПриЗакрытииЗаменыОборудования = Новый ОписаниеОповещения("ОповещениеПриЗакрытииЗаменыОборудования", ЭтотОбъект, ТекущиеДанные.Этап);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("АдресТЗОперации", АдресТЗОперации);
			ОткрытьФорму("Обработка.ФормированиеСменныхЗаданий.Форма.бит_ФормаЗаменыОборудования", ПараметрыФормы, ЭтаФорма,,,,ОповещениеПриЗакрытииЗаменыОборудования,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
			
		КонецЕсли;
		
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.64] [ASHolyavko@1cbit.ru] [18.01.2026] -
	
КонецПроцедуры 

&НаКлиенте
Процедура ОповещениеПриЗакрытииЗаменыОборудования(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		ВывестиСообщенияФормирования(Результат, ДополнительныеПараметры);
		
		//Элементы.Операции.Обновить();
	
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ВывестиСообщенияФормирования(Результат, ТекущийЭтап)
				
	СтруктураРезультата = ПолучитьИзВременногоХранилища(Результат);
	
	Ошибки = СтруктураРезультата.Ошибки;
	
	Для Каждого СтрокаОшибок Из Ошибки Цикл
		Если ЗначениеЗаполнено(СтрокаОшибок.Сообщения) Тогда
			
			Сообщить("Ошибка формирование этапа!");
			
			//СообщениеПользователю = Новый СообщениеПользователю;
			//СообщениеПользователю.Текст = "Создан новый документ: " + Строка(СтрокаРезультата.Документ);
			//СообщениеПользователю.УстановитьДанные(СтрокаРезультата.Документ);
			//СообщениеПользователю.Сообщить();
			
		КонецЕсли;
	КонецЦикла;
	
	РезультатФормирования = СтруктураРезультата.РезультатФормирования;
	
	СозданНовыйЭтап = Ложь;
	
	Для Каждого СтрокаРезультата Из РезультатФормирования Цикл
		Если ЗначениеЗаполнено(СтрокаРезультата.Документ) Тогда
			
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Создан новый документ: " + Строка(СтрокаРезультата.Документ);
			СообщениеПользователю.КлючДанных = СтрокаРезультата.Документ;
			СообщениеПользователю.УстановитьДанные(СтрокаРезультата.Документ);
			СообщениеПользователю.Сообщить();
			
			СозданНовыйЭтап = Истина;
						
		КонецЕсли;
	КонецЦикла;
	
	Если СозданНовыйЭтап Тогда
		
		ПричинаОтмены = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ПричинаЗаменыОборудования, ЭтотОбъект, Истина);
		
		КоличествоОперации = 0;
		КоличествоСменноеЗадание = 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственнаяОперация2_2.Этап КАК Этап,
		|	СУММА(ПроизводственнаяОперация2_2.Количество) КАК КоличествоОперации,
		|	СУММА(0) КАК КоличествоСменноеЗадание
		|ИЗ
		|	Документ.ПроизводственнаяОперация2_2 КАК ПроизводственнаяОперация2_2
		|ГДЕ
		|	ПроизводственнаяОперация2_2.Этап = &Этап
		|	И ПроизводственнаяОперация2_2.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроизводственнаяОперация2_2.Этап
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОперацииКСозданиюСменныхЗаданий.Этап,
		|	СУММА(0),
		|	СУММА(ОперацииКСозданиюСменныхЗаданий.Количество)
		|ИЗ
		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК ОперацииКСозданиюСменныхЗаданий
		|ГДЕ
		|	ОперацииКСозданиюСменныхЗаданий.Этап = &Этап
		|	И ОперацииКСозданиюСменныхЗаданий.СменноеЗадание <> ЗНАЧЕНИЕ(Документ.СменноеЗадание.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацииКСозданиюСменныхЗаданий.Этап";
		
		Запрос.УстановитьПараметр("Этап", ТекущийЭтап);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//КоличествоВОперациях = КоличествоВОперациях + ВыборкаДетальныеЗаписи.Количество;
			КоличествоОперации = КоличествоОперации + ВыборкаДетальныеЗаписи.КоличествоОперации;
			КоличествоСменноеЗадание = КоличествоСменноеЗадание + ВыборкаДетальныеЗаписи.КоличествоСменноеЗадание;
		КонецЦикла;
	
		СтарыйЭтапОбъект = ТекущийЭтап.ПолучитьОбъект();
		СтарыйЭтапОбъект.КоличествоУпаковокОтменено = СтарыйЭтапОбъект.КоличествоУпаковокПлан - КоличествоОперации  - КоличествоСменноеЗадание;
		//СтарыйЭтапОбъект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен;
		СтарыйЭтапОбъект.бит_ЗамененНовымЭтапом = Истина;
		СтарыйЭтапОбъект.ОтразитьКоличествоОтмененоВТЧ(ПричинаОтмены);
		СтарыйЭтапОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//СтарыйЭтапОбъект.ПометкаУдаления = Истина;
		//СтарыйЭтапОбъект.Записать(); 
		
		//СообщениеПользователю = Новый СообщениеПользователю;
		//СообщениеПользователю.Текст = "Этап: " + Строка(ТекущийЭтап) + " помечен на удаление!";
		//СообщениеПользователю.КлючДанных = ТекущийЭтап;
		//СообщениеПользователю.УстановитьДанные(ТекущийЭтап);
		//СообщениеПользователю.Сообщить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперацииКСозданиюСменныхЗаданий.Подразделение КАК Подразделение,
		|	ОперацииКСозданиюСменныхЗаданий.СменноеЗадание КАК СменноеЗадание,
		|	ОперацииКСозданиюСменныхЗаданий.Этап КАК Этап,
		|	ОперацииКСозданиюСменныхЗаданий.Операция КАК Операция,
		|	ОперацииКСозданиюСменныхЗаданий.ИдентификаторОперации КАК ИдентификаторОперации,
		|	ОперацииКСозданиюСменныхЗаданий.Исполнитель КАК Исполнитель,
		|	ОперацииКСозданиюСменныхЗаданий.Участок КАК Участок,
		|	ОперацииКСозданиюСменныхЗаданий.РабочийЦентр КАК РабочийЦентр,
		|	ОперацииКСозданиюСменныхЗаданий.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	ОперацииКСозданиюСменныхЗаданий.НазначатьНеРанее КАК НазначатьНеРанее
		|ИЗ
		|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК ОперацииКСозданиюСменныхЗаданий
		|ГДЕ
		|	ОперацииКСозданиюСменныхЗаданий.Этап = &Этап
		|	И ОперацииКСозданиюСменныхЗаданий.СменноеЗадание = ЗНАЧЕНИЕ(Документ.СменноеЗадание.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Этап", ТекущийЭтап);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//	
			НЗ = РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.СоздатьНаборЗаписей();
			
			НЗ.Отбор.Подразделение.Установить(ВыборкаДетальныеЗаписи.Подразделение);
			НЗ.Отбор.СменноеЗадание.Установить(ВыборкаДетальныеЗаписи.СменноеЗадание);
			НЗ.Отбор.Этап.Установить(ВыборкаДетальныеЗаписи.Этап);
			НЗ.Отбор.Операция.Установить(ВыборкаДетальныеЗаписи.Операция);
			НЗ.Отбор.ИдентификаторОперации.Установить(ВыборкаДетальныеЗаписи.ИдентификаторОперации);
			НЗ.Отбор.Исполнитель.Установить(ВыборкаДетальныеЗаписи.Исполнитель);
			НЗ.Отбор.Участок.Установить(ВыборкаДетальныеЗаписи.Участок);
			НЗ.Отбор.РабочийЦентр.Установить(ВыборкаДетальныеЗаписи.РабочийЦентр);
			НЗ.Отбор.ВидРабочегоЦентра.Установить(ВыборкаДетальныеЗаписи.ВидРабочегоЦентра);
			НЗ.Отбор.НазначатьНеРанее.Установить(ВыборкаДетальныеЗаписи.НазначатьНеРанее);
			
			НЗ.Записать();
			
		КонецЦикла;
			
	КонецЕсли;
	
	Элементы.Операции.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТЗОперации(КлючиОпераций)
	
	Порядок = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ОперацииТЗ = РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	Для каждого Ключ Из КлючиОпераций Цикл
		
		НоваяСтрока = ОперацииТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Ключ);
		НоваяСтрока.Порядок = Порядок;
		
		Порядок = Порядок + 1;
		
	КонецЦикла;
	
	Адрес = ПоместитьВоВременноеХранилище(ОперацииТЗ);
	
	Возврат Адрес;
	
КонецФункции

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьСмены")
Процедура бит_ЗаполнитьСмены()

	АктивизироватьСтроку = Элементы.Смены.ТекущаяСтрока = Неопределено;

	Смены.ПолучитьЭлементы().Очистить();
	ВыделитьКнопкуНастроитьСоставСмен();

	Если Подразделение.Пустая() ИЛИ СоставСмен.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	НесколькоСменВПодразделении = ПроизводствоСервер.ГрафикиРаботыПодразделений(Подразделение).Количество() > 1;

	// Чтение состава смен
	Запрос = Новый Запрос(ТекстЗапросаСмены());
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Задания", СоставСмен.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("НазначатьИсполнителям", РежимНазначения = РежимНазначенияИсполнителям());
	Запрос.УстановитьПараметр("НазначатьРабочимЦентрам", РежимНазначения = РежимНазначенияРабочимЦентрам());
	Запрос.УстановитьПараметр("НазначатьВидамРЦ", РежимНазначения = РежимНазначенияВидамРЦ());

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаИтоги = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если НЕ ВыборкаИтоги.Следующий() Тогда
		Возврат;
	КонецЕсли;
	ВыборкаСЗ = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ТаблицаСмены = РезультатЗапроса.Выгрузить();

	// Чтение расписания
	ВсеГрафики = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаСмены.ВыгрузитьКолонку("Смена"));
	ВсеСсылки = Неопределено;
	ГрафикиРЦ = Неопределено;
	Если РежимНазначения <> РежимНазначенияИсполнителям() Тогда
		ВсеСсылки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаСмены.ВыгрузитьКолонку("ОбъектНазначения"));
		ГрафикиРЦ = ПроизводствоСервер.ГрафикиРаботыРЦ(ВсеСсылки, РежимНазначения = РежимНазначенияРабочимЦентрам());
		ГрафикиРЦ.Индексы.Добавить("Ссылка, ГрафикРаботы");
		ГрафикиРЦ.Индексы.Добавить("Ссылка");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеГрафики, ГрафикиРЦ.ВыгрузитьКолонку("ГрафикРаботы"), Истина);
	КонецЕсли;

	Расписание = ПланированиеПроизводства.РасписаниеРаботыПоГрафику(
	ВсеГрафики,
	НачалоДня(ВыборкаИтоги.ДатаМин),
	КонецДня(ВыборкаИтоги.Дата));
	Расписание.Индексы.Добавить("ДатаГрафика, ГрафикРаботы");
	СтруктураПоиска1 = Новый Структура("ДатаГрафика, ГрафикРаботы");

	СоставВРЦ = Неопределено;
	СтруктураПоиска2 = Неопределено;
	Если РежимНазначения = РежимНазначенияВидамРЦ() Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВидыРабочихЦентров.Ссылка КАК ОбъектНазначения,
		|	РабочиеЦентры.Участок     КАК Участок,
		|	ЕСТЬNULL(РабочиеЦентры.Ссылка, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр
		|ИЗ
		|	Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РабочиеЦентры КАК РабочиеЦентры
		|		ПО ВидыРабочихЦентров.Ссылка = РабочиеЦентры.ВидРабочегоЦентра
		|			И (РабочиеЦентры.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	ВидыРабочихЦентров.Ссылка В(&Ссылки)");
		Запрос.УстановитьПараметр("Ссылки", ВсеСсылки);
		СоставВРЦ = Запрос.Выполнить().Выгрузить();
		СоставВРЦ.Индексы.Добавить("ОбъектНазначения, Участок");
		СтруктураПоиска2 = Новый Структура("ОбъектНазначения, Участок");
	КонецЕсли;

	// Заполнение дерева
	Дерево = РеквизитФормыВЗначение("Смены");
	Пока ВыборкаСЗ.Следующий() Цикл

		// Строка - смена
		СтрокаСмена = Дерево.Строки.Добавить();

		ЗаполнитьЗначенияСвойств(СтрокаСмена, ВыборкаСЗ, "СменноеЗадание, Дата, Участок, КоличествоОпераций");

		СтрокаСмена.ТипСтроки = ТипСтрокиСмена();
		СтрокаСмена.ОбъектНазначения = ВыборкаСЗ.СменноеЗадание;

		СтрокаСмена.ПредставлениеОбъекта = УправлениеПроизводствомКлиентСервер.ПредставлениеСменногоЗадания(
		ВыборкаСЗ.Смена, ВыборкаСЗ.Дата, ВыборкаСЗ.Участок, НесколькоСменВПодразделении);

		// Длительность
		СтруктураПоиска1.ДатаГрафика = НачалоДня(ВыборкаСЗ.Дата);
		СтруктураПоиска1.ГрафикРаботы = ВыборкаСЗ.Смена;
		РасписаниеСмены = Расписание.НайтиСтроки(СтруктураПоиска1);

		СуммаСекунды = 0;
		Для каждого Строка Из РасписаниеСмены Цикл
			СуммаСекунды = СуммаСекунды + Строка.Длительность;
		КонецЦикла;

		СтрокаСмена.Длительность = Окр(
		ПланированиеПроизводстваКлиентСервер.ПолучитьВремяВЕдиницеИзмерения(
		СуммаСекунды,
		Перечисления.ЕдиницыИзмеренияВремени.Час),
		1);

		// Представление
		ЗаполнитьПредставлениеСтрокиСмены(СтрокаСмена);
		
		#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ5.35] [ASHolyavko@1cbit.ru] [20.04.2026] +        
		
		СтрокаСмена.ПредставлениеСтроки = СтрокаСмена.ПредставлениеСтроки + ". Номер смены: " + ВыборкаСЗ.Смена.бит_НомерСмены; 
		
		#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ5.35] [ASHolyavko@1cbit.ru] [20.04.2026] -
				
		Выборка = ВыборкаСЗ.Выбрать();
		Пока Выборка.Следующий() Цикл

			Если Выборка.КоличествоОпераций = 0 И Выборка.ОбъектНазначения.Пустая() Тогда
				Продолжить;
			КонецЕсли;

			// Строка - объект назначения
			СтрокаОбъект = СтрокаСмена.Строки.Добавить();

			ЗаполнитьЗначенияСвойств(СтрокаОбъект, Выборка, "СменноеЗадание, Дата, Участок, ОбъектНазначения, ВидРабочегоЦентра, КоличествоОпераций");

			Если Выборка.ОбъектНазначения.Пустая() Тогда
				СтрокаОбъект.ТипСтроки = ТипСтрокиОбъектНеНазначен();
				СтрокаОбъект.ПредставлениеОбъекта = ?(РежимНазначения = РежимНазначенияИсполнителям(),
				НСтр("ru = '<исполнитель не назначен>';
				|en = '<no assignee>'"),
				?(РежимНазначения = РежимНазначенияРабочимЦентрам(),
				НСтр("ru = '<рабочий центр не назначен>';
				|en = '<work center is not specified>'"),
				НСтр("ru = '<вид РЦ не назначен>';
				|en = '<work center type is not specified>'")));
			Иначе
				СтрокаОбъект.ТипСтроки = ТипСтрокиОбъект();
				СтрокаОбъект.ПредставлениеОбъекта = Выборка.ПредставлениеОбъекта;

				Если РежимНазначения = РежимНазначенияИсполнителям() Тогда
					СтрокаОбъект.Длительность = СтрокаСмена.Длительность;
				Иначе

					Если РежимНазначения = РежимНазначенияВидамРЦ() Тогда

						ЗаполнитьЗначенияСвойств(СтруктураПоиска2, Выборка, "ОбъектНазначения, Участок");
						СтрокиСостава = СоставВРЦ.НайтиСтроки(СтруктураПоиска2);
						Для каждого Строка Из СтрокиСостава Цикл
							СтрокаОбъект.Длительность = СтрокаОбъект.Длительность
							+ РассчитатьДлительность(
							Строка.РабочийЦентр,
							ГрафикиРЦ,
							Расписание,
							ВыборкаСЗ.Смена,
							СтрокаСмена.Длительность,
							НачалоДня(ВыборкаСЗ.Дата),
							РасписаниеСмены);
						КонецЦикла;

					Иначе

						СтрокаОбъект.Длительность = РассчитатьДлительность(
						Выборка.ОбъектНазначения,
						ГрафикиРЦ,
						Расписание,
						ВыборкаСЗ.Смена,
						СтрокаСмена.Длительность,
						НачалоДня(ВыборкаСЗ.Дата),
						РасписаниеСмены);

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

			СтрокаОбъект.Загрузка = Окр(
			ПланированиеПроизводстваКлиентСервер.ПолучитьВремяВЕдиницеИзмерения(
			Выборка.ЗагрузкаСекунды,
			Перечисления.ЕдиницыИзмеренияВремени.Час),
			1);
			СтрокаОбъект.Свободно = ?(СтрокаОбъект.Длительность > СтрокаОбъект.Загрузка,
			СтрокаОбъект.Длительность - СтрокаОбъект.Загрузка, 0);
            
			СтрокаСмена.Загрузка = СтрокаСмена.Загрузка + СтрокаОбъект.Загрузка;
			СтрокаСмена.Свободно = СтрокаСмена.Свободно + СтрокаОбъект.Свободно;
			#Вставка     
			// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 3:58:15] +        
			Если Не ЭтаФорма.бит_ТиповаяФорма Тогда
				СтрокаСмена.бит_СвободноМинуты = СтрокаСмена.Свободно * 60;
				СтрокаСмена.бит_ЗагрузкаМинуты = СтрокаСмена.Загрузка * 60; 
				
				СтрокаОбъект.бит_СвободноМинуты = СтрокаОбъект.Свободно * 60;
				СтрокаОбъект.бит_ЗагрузкаМинуты = СтрокаОбъект.Загрузка * 60; 
			КонецЕсли;
			// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 3:58:15] -
			#КонецВставки

			ЗаполнитьПредставлениеСтрокиСмены(СтрокаОбъект);

		КонецЦикла;

		// Строка - добавить исполнителей
		Если РежимНазначения = РежимНазначенияИсполнителям() Тогда

			СтрокаКоманда = СтрокаСмена.Строки.Добавить();

			ЗаполнитьЗначенияСвойств(СтрокаКоманда, ВыборкаСЗ, "СменноеЗадание, Дата, Участок");

			СтрокаКоманда.ТипСтроки = ТипСтрокиНовыйИсполнитель();
			СтрокаКоманда.Действие = НСтр("ru = '<добавить исполнителей>';
			|en = '<add assignees>'");

		КонецЕсли;

	КонецЦикла;

	ЗначениеВРеквизитФормы(Дерево, "Смены");
	ВыделитьКнопкуНастроитьСоставСмен();

	Если АктивизироватьСтроку И Дерево.Строки.Количество() <> 0 Тогда
		Элементы.Смены.ТекущаяСтрока = Смены.ПолучитьЭлементы()[0].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("НастроитьОтборОпераций")
Процедура бит_НастроитьОтборОпераций()

	Источник = Элементы.Смены.ТекущиеДанные;
	ЕстьИсточник = Источник <> Неопределено;

	//

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Операции,
	"НазначатьНеРанее",
	?(ЕстьИсточник, Источник.Дата, Неопределено),
	ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,,
	ЕстьИсточник И РежимПросмотра = РежимПросмотраМожноНазначать());

	//

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Операции,
	"МожноНазначать",
	Истина,
	ВидСравненияКомпоновкиДанных.Равно,,
	РежимПросмотра = РежимПросмотраМожноНазначать());

	//

	Значение = Неопределено;
	ВидСравненияСКД = ВидСравненияКомпоновкиДанных.Равно;

	Если РежимПросмотра = РежимПросмотраВсеКНазначению() Тогда
		Значение = ПредопределенноеЗначение("Документ.СменноеЗадание.ПустаяСсылка");
	ИначеЕсли РежимПросмотра = РежимПросмотраНазначенные() Тогда
		Если ЕстьИсточник Тогда
			Значение = Источник.СменноеЗадание;
		Иначе
			Значение = ПредопределенноеЗначение("Документ.СменноеЗадание.ПустаяСсылка");
			ВидСравненияСКД = ВидСравненияКомпоновкиДанных.Заполнено;
		КонецЕсли;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Операции,
	"СменноеЗадание",
	Значение,
	ВидСравненияСКД,,
	Значение <> Неопределено);

	//

	ОтборПоОбъекту = ЕстьИсточник
	И РежимПросмотра = РежимПросмотраНазначенные()
	И (Источник.ТипСтроки = ТипСтрокиОбъект()
	ИЛИ Источник.ТипСтроки = ТипСтрокиОбъектНеНазначен());

	//

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Операции,
	"Исполнитель",
	?(ЕстьИсточник, Источник.ОбъектНазначения, Неопределено),
	ВидСравненияКомпоновкиДанных.Равно,,
	ОтборПоОбъекту И РежимНазначения = РежимНазначенияИсполнителям());

	//

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Операции,
	"РабочийЦентр",
	?(ЕстьИсточник, Источник.ОбъектНазначения, Неопределено),
	ВидСравненияКомпоновкиДанных.Равно,,
	ОтборПоОбъекту И РежимНазначения = РежимНазначенияРабочимЦентрам());

	//

	Значение = Неопределено;
	ВидСравненияСКД = ВидСравненияКомпоновкиДанных.Равно;

	Если ОтборПоОбъекту И РежимНазначения = РежимНазначенияВидамРЦ() Тогда

		Значение = Источник.ОбъектНазначения;

	ИначеЕсли ЕстьИсточник
		И Источник.ТипСтроки = ТипСтрокиОбъект()
		И (РежимПросмотра = РежимПросмотраМожноНазначать()
		ИЛИ РежимПросмотра = РежимПросмотраВсеКНазначению())
		И (РежимНазначения = РежимНазначенияРабочимЦентрам()
		ИЛИ РежимНазначения = РежимНазначенияВидамРЦ()) Тогда

		Значение = Новый СписокЗначений;
		Значение.Добавить(Источник.ВидРабочегоЦентра);
		Значение.Добавить(ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.ПустаяСсылка"));
		Значение.Добавить(ПредопределенноеЗначение("Справочник.РабочиеЦентры.ПустаяСсылка"));
		Значение.Добавить(Неопределено);
		#Вставка     
		// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 3:29:42] +  
		Если Не ЭтаФорма.бит_ТиповаяФорма Тогда 
			ДополнитьСписокНаСервереБезКонтекста(Источник.ВидРабочегоЦентра, Значение); 
		КонецЕсли;
		// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 3:29:42] -
		#КонецВставки

		ВидСравненияСКД = ВидСравненияКомпоновкиДанных.ВСписке;

	КонецЕсли;
	#Вставка     
	// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [06.05.2026 1:11:51] +        
	Если ЭтаФорма.бит_ТиповаяФорма Тогда
	// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [06.05.2026 1:11:51] -
	#КонецВставки

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Операции,
	"ВидРабочегоЦентра",
	Значение,
	ВидСравненияСКД,,
	Значение <> Неопределено);
	#Вставка     
	// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [06.05.2026 1:12:21] +  
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Операции,
		"бит_ВРЦ",
		Значение,
		ВидСравненияСКД,,
		Значение <> Неопределено);
    КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [06.05.2026 1:12:21] -
	#КонецВставки

	//

	УстановитьОтборПоУчастку = ОтборПоУчастку
	И ЕстьИсточник
	И НЕ Источник.Участок.Пустая()
	И (РежимПросмотра = РежимПросмотраМожноНазначать()
	ИЛИ РежимПросмотра = РежимПросмотраВсеКНазначению());

	Операции.Параметры.УстановитьЗначениеПараметра("ОтборПоУчастку", УстановитьОтборПоУчастку);

	Операции.Параметры.УстановитьЗначениеПараметра("Участок",
	?(УстановитьОтборПоУчастку, Источник.Участок, Неопределено));

	Операции.Параметры.УстановитьЗначениеПараметра("НачалоПериода", ДатаНачала);
	Операции.Параметры.УстановитьЗначениеПараметра("КонецПериода", ДатаОкончания);
	Операции.Параметры.УстановитьЗначениеПараметра("ПланируетсяГрафикПроизводства", ПланируетсяГрафикПроизводства);

КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ДополнитьСписокНаСервереБезКонтекста(ВидРабочегоЦентра, Значение)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 3:36:54] +        
	Если ЗначениеЗаполнено(ВидРабочегоЦентра.Родитель) Тогда
		Выборка = Справочники.ВидыРабочихЦентров.Выбрать(ВидРабочегоЦентра.Родитель);
		Пока Выборка.Следующий() Цикл
			Если Значение.НайтиПоЗначению(Выборка.Ссылка) = Неопределено Тогда
				Значение.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 3:36:54] -
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбновитьСменыПослеНазначенияОпераций")
Процедура бит_ОбновитьСменыПослеНазначенияОпераций(МассивСмен)

	Если МассивСмен.ВГраница() = -1 Тогда
		Возврат;
	КонецЕсли;

	КешТекСтроки = ЗакешироватьТекСтрокуДерева();

	Дерево = РеквизитФормыВЗначение("Смены");

	// Выборка изменений
	Запрос = Новый Запрос(ТекстЗапросаОбновлениеСмены());
	Запрос.УстановитьПараметр("Задания", МассивСмен);
	Запрос.УстановитьПараметр("НазначатьИсполнителям", РежимНазначения = РежимНазначенияИсполнителям());
	Запрос.УстановитьПараметр("НазначатьРабочимЦентрам", РежимНазначения = РежимНазначенияРабочимЦентрам());
	Запрос.УстановитьПараметр("НазначатьВидамРЦ", РежимНазначения = РежимНазначенияВидамРЦ());

	СоставЗаданий = Запрос.Выполнить().Выгрузить();
	СоставЗаданий.Индексы.Добавить("СменноеЗадание, ОбъектНазначения");
	СтруктураПоиска = Новый Структура("СменноеЗадание, ОбъектНазначения");

	ПолныйПересчет = Ложь;

	Для каждого СменноеЗадание Из МассивСмен Цикл

		// Обновление строки - смены
		СтрокаСмена = Дерево.Строки.Найти(СменноеЗадание, "СменноеЗадание");

		Если СтрокаСмена = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		СтрокаСмена.КоличествоОпераций = 0;
		СтрокаСмена.Загрузка = 0;
		СтрокаСмена.Свободно = 0;

		СчОбъектов = 0;

		Для каждого СтрокаОбъект Из СтрокаСмена.Строки Цикл

			Если СтрокаОбъект.ТипСтроки = ТипСтрокиНовыйИсполнитель() Тогда
				Продолжить;
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаОбъект);
			НайденныеСтроки = СоставЗаданий.НайтиСтроки(СтруктураПоиска);

			Если НайденныеСтроки.ВГраница() = -1 Тогда

				СтрокаОбъект.КоличествоОпераций = 0;
				СтрокаОбъект.Загрузка = 0;
				СтрокаОбъект.Свободно = СтрокаОбъект.Длительность;

				СтрокаСмена.Свободно = СтрокаСмена.Свободно + СтрокаОбъект.Свободно;

			Иначе

				СтрокаОбъект.КоличествоОпераций = НайденныеСтроки[0].КоличествоОпераций;
				СтрокаОбъект.Загрузка = Окр(
				ПланированиеПроизводстваКлиентСервер.ПолучитьВремяВЕдиницеИзмерения(
				НайденныеСтроки[0].ЗагрузкаСекунды,
				Перечисления.ЕдиницыИзмеренияВремени.Час),
				1);
				СтрокаОбъект.Свободно = ?(СтрокаОбъект.Длительность > СтрокаОбъект.Загрузка,
				СтрокаОбъект.Длительность - СтрокаОбъект.Загрузка, 0);

				СтрокаСмена.КоличествоОпераций = СтрокаСмена.КоличествоОпераций + СтрокаОбъект.КоличествоОпераций;
				СтрокаСмена.Загрузка = СтрокаСмена.Загрузка + СтрокаОбъект.Загрузка;
				СтрокаСмена.Свободно = СтрокаСмена.Свободно + СтрокаОбъект.Свободно;

				СчОбъектов = СчОбъектов + 1;

			КонецЕсли; 
			#Вставка     
			// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 3:58:15] +
			Если Не ЭтаФорма.бит_ТиповаяФорма Тогда
				СтрокаСмена.бит_СвободноМинуты = СтрокаСмена.Свободно * 60;
				СтрокаСмена.бит_ЗагрузкаМинуты = СтрокаСмена.Загрузка * 60; 
				
				СтрокаОбъект.бит_СвободноМинуты = СтрокаОбъект.Свободно * 60;
				СтрокаОбъект.бит_ЗагрузкаМинуты = СтрокаСмена.Загрузка * 60;
			КонецЕсли;
			// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 3:58:15] -
			#КонецВставки

			ЗаполнитьПредставлениеСтрокиСмены(СтрокаОбъект);

		КонецЦикла;

		Если СчОбъектов <> СоставЗаданий.НайтиСтроки(Новый Структура("СменноеЗадание", СменноеЗадание)).Количество() Тогда

			ПолныйПересчет = Истина;
			Прервать;

		Иначе

			ЗаполнитьПредставлениеСтрокиСмены(СтрокаСмена);

			СтрокаОбъектНеНазначен = СтрокаСмена.Строки.Найти(ТипСтрокиОбъектНеНазначен(), "ТипСтроки");
			Если СтрокаОбъектНеНазначен <> Неопределено
				И СтрокаОбъектНеНазначен.КоличествоОпераций = 0 Тогда

				СтрокаСмена.Строки.Удалить(СтрокаОбъектНеНазначен);

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Если ПолныйПересчет Тогда

		ЗаполнитьСмены();

		УстановитьТекСтрокуДереваИзКеша(КешТекСтроки, РеквизитФормыВЗначение("Смены"));

	Иначе

		ЗначениеВРеквизитФормы(Дерево, "Смены");

		УстановитьТекСтрокуДереваИзКеша(КешТекСтроки, Дерево);

	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ДобавитьИсполнителей")
Процедура бит_ДобавитьИсполнителей(СменноеЗадание, Ссылки)

	КешТекСтроки = ЗакешироватьТекСтрокуДерева();

	Дерево = РеквизитФормыВЗначение("Смены");

	СтрокаСмена = Дерево.Строки.Найти(СменноеЗадание, "СменноеЗадание");
	Если СтрокаСмена = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НовыеИсполнители = Новый Массив;
	Для каждого Ссылка Из Ссылки Цикл
		Если СтрокаСмена.Строки.Найти(Ссылка, "ОбъектНазначения") = Неопределено Тогда
			НовыеИсполнители.Добавить(Ссылка);
		КонецЕсли;
	КонецЦикла;
	Если НовыеИсполнители.ВГраница() = -1 Тогда
		Возврат;
	КонецЕсли;

	Документы.СменноеЗадание.ДобавитьИсполнителей(СменноеЗадание, НовыеИсполнители);

	Для каждого Ссылка Из НовыеИсполнители Цикл

		СтрокаОбъект = СтрокаСмена.Строки.Добавить();

		ЗаполнитьЗначенияСвойств(СтрокаОбъект, СтрокаСмена, "СменноеЗадание, Дата, Участок, Длительность");

		СтрокаОбъект.ТипСтроки = ТипСтрокиОбъект();
		СтрокаОбъект.ОбъектНазначения = Ссылка;
		СтрокаОбъект.ПредставлениеОбъекта = Ссылка;
		СтрокаОбъект.Свободно = СтрокаОбъект.Длительность;

		СтрокаСмена.Свободно = СтрокаСмена.Свободно + СтрокаОбъект.Свободно;

		ЗаполнитьПредставлениеСтрокиСмены(СтрокаОбъект);
		#Вставка     
		// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 3:58:15] +        
		Если Не ЭтаФорма.бит_ТиповаяФорма Тогда
			СтрокаСмена.бит_СвободноМинуты = СтрокаСмена.Свободно * 60;   
			
			СтрокаОбъект.бит_СвободноМинуты = СтрокаОбъект.Свободно * 60;
		КонецЕсли;
		// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 3:58:15] -
		#КонецВставки

	КонецЦикла;

	СтрокаСмена.Строки.Сортировать("ТипСтроки, ПредставлениеОбъекта");

	ЗначениеВРеквизитФормы(Дерево, "Смены");

	УстановитьТекСтрокуДереваИзКеша(КешТекСтроки, Дерево);

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("УдалитьТекущегоИсполнителя")
Процедура бит_УдалитьТекущегоИсполнителя()

	СтрокаОбъект = Элементы.Смены.ТекущиеДанные;
	Если СтрокаОбъект = Неопределено Тогда

		ПоказатьПредупреждение(, НСтр("ru = 'Не выбран исполнитель';
		|en = 'Assignee is not selected'"));
		Возврат;

	ИначеЕсли СтрокаОбъект.Загрузка > 0 Тогда

		ПоказатьПредупреждение(, НСтр("ru = 'Исполнителю назначены операции, удаление невозможно';
		|en = 'The assignee has operations assigned. Cannot delete assignee.'"));
		Возврат;

	КонецЕсли;

	УдалитьИсполнителяНаСервере(СтрокаОбъект.СменноеЗадание, СтрокаОбъект.ОбъектНазначения);

	СтрокаСмена = СтрокаОбъект.ПолучитьРодителя();
	СтрокаСмена.Свободно = СтрокаСмена.Свободно - СтрокаОбъект.Свободно;
	#Вставка     
	// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 4:12:34] +        
	Если Не ЭтаФорма.бит_ТиповаяФорма Тогда
		СтрокаСмена.бит_СвободноМинут = СтрокаСмена.Свободно * 60;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 4:12:34] -
	#КонецВставки

	СтрокаСмена.ПолучитьЭлементы().Удалить(СтрокаОбъект);

КонецПроцедуры

&НаСервере
Процедура бит_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 1:50:12] +        
	мПользователейСТиповойФормой = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ПользователиСТиповымФормированиемСменныхЗаданий);
	бит_ТиповаяФорма = мПользователейСТиповойФормой.Найти(Пользователи.АвторизованныйПользователь()) <> Неопределено;
	
	мРеквизитов = новый Массив;
	// для операций
	мРеквизитов.Добавить(Новый РеквизитФормы("бит_ТиповаяФорма",Новый ОписаниеТипов("Булево")));  
	// для смен
	Если Не бит_ТиповаяФорма Тогда
		мРеквизитов.Добавить(Новый РеквизитФормы("бит_СвободноМинуты",Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10,2, ДопустимыйЗнак.Неотрицательный)), "Смены"));  
		мРеквизитов.Добавить(Новый РеквизитФормы("бит_ЗагрузкаМинуты",Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10,2, ДопустимыйЗнак.Неотрицательный)), "Смены"));  
	КонецЕсли;
	ИзменитьРеквизиты(мРеквизитов);
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("бит_ТиповаяФорма", Тип("ПолеФормы"), Элементы.Шапка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;               
	НовыйЭлемент.Заголовок = "(бит) ТиповаяФорма";
	НовыйЭлемент.ПутьКДанным = "бит_ТиповаяФорма";     
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Подсказка = "Настройка в элементе справочника по умолчанию  'Пользователи с типовым формированием сменных заданий'";
	//НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзменениибит_ТиповаяФорма");
	
	Если Не бит_ТиповаяФорма Тогда
		// список Операции  
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	РегистрПереопределяемый.Этап КАК Этап
		               |ПОМЕСТИТЬ База
		               |ИЗ
		               |	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК РегистрПереопределяемый
		               |ГДЕ
		               |	(РегистрПереопределяемый.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка)
		               |			ИЛИ РегистрПереопределяемый.РабочийЦентр <> ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
		               |				И ИСТИНА В
		               |					(ВЫБРАТЬ ПЕРВЫЕ 1
		               |						ИСТИНА
		               |					ИЗ
		               |						Справочник.РабочиеЦентры КАК РабочиеЦентрыПереопределяемый
		               |					ГДЕ
		               |						РабочиеЦентрыПереопределяемый.Ссылка = РегистрПереопределяемый.РабочийЦентр
		               |						И РабочиеЦентрыПереопределяемый.Участок = &Участок)
		               |			ИЛИ РегистрПереопределяемый.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
		               |				И ИСТИНА В
		               |					(ВЫБРАТЬ ПЕРВЫЕ 1
		               |						ИСТИНА
		               |					ИЗ
		               |						Справочник.РабочиеЦентры КАК РабочиеЦентрыПереопределяемый
		               |					ГДЕ
		               |						РабочиеЦентрыПереопределяемый.ВидРабочегоЦентра = РегистрПереопределяемый.ВидРабочегоЦентра
		               |						И РабочиеЦентрыПереопределяемый.Участок = &Участок))
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЭтапПроизводства2_2ВидыРабочихЦентров.ВидРабочегоЦентра КАК бит_ВРЦ,
		               |	База.Этап КАК Этап
		               |ПОМЕСТИТЬ втВРЦ
		               |ИЗ
		               |	База КАК База
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВидыРабочихЦентров КАК ЭтапПроизводства2_2ВидыРабочихЦентров
		               |		ПО База.Этап = ЭтапПроизводства2_2ВидыРабочихЦентров.Ссылка
		               |ГДЕ
		               |	ЭтапПроизводства2_2ВидыРабочихЦентров.Использовать
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.ВидРабочегоЦентра,
		               |	База.Этап
		               |ИЗ
		               |	База КАК База
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.АльтернативныеВидыРабочихЦентров КАК ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров
		               |		ПО База.Этап = ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.Ссылка
		               |ГДЕ
		               |	ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.Использовать
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Этап
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РегистрПереопределяемый.Подразделение КАК Подразделение,
		               |	РегистрПереопределяемый.Этап КАК Этап,
		               |	РегистрПереопределяемый.Этап.ПартияПроизводства.ОсновноеИзделиеНоменклатура КАК Номенклатура,
		               |	РегистрПереопределяемый.Этап.ПартияПроизводства.ОсновноеИзделиеХарактеристика КАК Характеристика,
		               |	РегистрПереопределяемый.Операция КАК Операция,
		               |	РегистрПереопределяемый.ИдентификаторОперации КАК ИдентификаторОперации,
		               |	РегистрПереопределяемый.СменноеЗадание КАК СменноеЗадание,
		               |	РегистрПереопределяемый.Исполнитель КАК Исполнитель,
		               |	РегистрПереопределяемый.РабочийЦентр КАК РабочийЦентр,
		               |	РегистрПереопределяемый.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		               |	РегистрПереопределяемый.НазначатьНеРанее КАК НазначатьНеРанее,
		               |	РегистрПереопределяемый.Количество КАК Количество,
		               |	&ВремяВыполнения КАК ВремяВыполнения,
		               |	РегистрПереопределяемый.ВремяЕдИзм КАК ВремяВыполненияЕдИзм,
		               |	РегистрПереопределяемый.МожноНазначать КАК МожноНазначать,
		               |	РегистрПереопределяемый.НужноНазначать КАК НужноНазначать,
		               |	РегистрПереопределяемый.НарушенПорядокНазначения КАК НарушенПорядокНазначения,
		               |	РегистрПереопределяемый.Распоряжение КАК Распоряжение,
		               |	РегистрПереопределяемый.НомерОперации КАК НомерОперации,
		               |	РегистрПереопределяемый.НомерСледующейОперации КАК НомерСледующейОперации,
		               |	ГрафикЭтаповПроизводства2_2.Начало КАК НачалоЭтапа,
		               |	ГрафикЭтаповПроизводства2_2.Окончание КАК ОкончаниеЭтапа,
		               |	втВРЦ.бит_ВРЦ КАК бит_ВРЦ,
		               |	втВРЦ.бит_ВРЦ.Родитель КАК бит_ГруппаВРЦ,
		               |	&ПредставлениеЭтапа КАК ПредставлениеЭтапа
		               |ИЗ
		               |	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК РегистрПереопределяемый
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ГрафикЭтаповПроизводства2_2
		               |		ПО РегистрПереопределяемый.Распоряжение = ГрафикЭтаповПроизводства2_2.ЗаказНаПроизводство
		               |			И РегистрПереопределяемый.Этап = ГрафикЭтаповПроизводства2_2.Этап
		               |			И (ГрафикЭтаповПроизводства2_2.СтатусГрафика = 0)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ втВРЦ КАК втВРЦ
		               |		ПО РегистрПереопределяемый.Этап = втВРЦ.Этап
		               |ГДЕ
		               |	(НЕ &ОтборПоУчастку
		               |			ИЛИ РегистрПереопределяемый.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка)
		               |			ИЛИ РегистрПереопределяемый.РабочийЦентр <> ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
		               |				И ИСТИНА В
		               |					(ВЫБРАТЬ ПЕРВЫЕ 1
		               |						ИСТИНА
		               |					ИЗ
		               |						Справочник.РабочиеЦентры КАК РабочиеЦентрыПереопределяемый
		               |					ГДЕ
		               |						РабочиеЦентрыПереопределяемый.Ссылка = РегистрПереопределяемый.РабочийЦентр
		               |						И РабочиеЦентрыПереопределяемый.Участок = &Участок)
		               |			ИЛИ РегистрПереопределяемый.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
		               |				И ИСТИНА В
		               |					(ВЫБРАТЬ ПЕРВЫЕ 1
		               |						ИСТИНА
		               |					ИЗ
		               |						Справочник.РабочиеЦентры КАК РабочиеЦентрыПереопределяемый
		               |					ГДЕ
		               |						РабочиеЦентрыПереопределяемый.ВидРабочегоЦентра = РегистрПереопределяемый.ВидРабочегоЦентра
		               |						И РабочиеЦентрыПереопределяемый.Участок = &Участок))
		               |	И (НЕ &ПланируетсяГрафикПроизводства
		               |			ИЛИ (&НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
		               |				ИЛИ ГрафикЭтаповПроизводства2_2.Начало >= &НачалоПериода)
		               |				И (&КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
		               |					ИЛИ ГрафикЭтаповПроизводства2_2.Окончание <= &КонецПериода))";
		
	    	
		Операции.ТекстЗапроса = ТекстЗапроса; 
		Операции.ОсновнаяТаблица = "РегистрСведений.ОперацииКСозданиюСменныхЗаданий";
		// отобразим на форме
		НовыйЭлемент = Элементы.Добавить("Операциибит_ВРЦ", Тип("ПолеФормы"), Элементы.Операции);
		НовыйЭлемент.ПутьКДанным = "Операции.бит_ВРЦ";
		НовыйЭлемент.Заголовок = "(бит) Вид рабочего центра"; 
		
		НовыйЭлемент = Элементы.Добавить("Операциибит_ГруппаВРЦ", Тип("ПолеФормы"), Элементы.Операции);
		НовыйЭлемент.ПутьКДанным = "Операции.бит_ГруппаВРЦ";
		НовыйЭлемент.Заголовок = "(бит) Группа ВРЦ";
		
		// Смены  
		НовыйЭлемент = Элементы.Добавить("Сменыбит_СвободноМинуты", Тип("ПолеФормы"), Элементы.Смены);
		НовыйЭлемент.ПутьКДанным = "Смены.бит_СвободноМинуты";
		НовыйЭлемент.Заголовок = "(бит) Свободно, мин.";
		
		НовыйЭлемент = Элементы.Добавить("Сменыбит_ЗагрузкаМинуты", Тип("ПолеФормы"), Элементы.Смены);
		НовыйЭлемент.ПутьКДанным = "Смены.бит_ЗагрузкаМинуты";
		НовыйЭлемент.Заголовок = "(бит) Загрузка, мин.";
	Иначе
		ЭтаФорма.бит_ТиповаяФорма = Истина;
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [04.05.2026 1:50:12] -
КонецПроцедуры
